Revit 2024 API
PhaseArray.ForwardIterator Method
Retrieve a forward moving iterator to the array.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public virtual PhaseArrayIterator ForwardIterator()
Visual Basic
Public Overridable Function ForwardIterator As PhaseArrayIterator
Visual C++
public:
virtual PhaseArrayIterator^ ForwardIterator()
Return Value
Returns a forward moving iterator to the array.
See Also
PhaseArray Class
Autodesk.Revit.DB Namespace